dev-resources/test/soap-request-13Za5C1MoWtNhopyZHI7Xc.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader" xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:xsd="http://www.w3.org/1999/XMLSchema" xmlns:ns="http://webservices.sabre.com/sabreXML/2011/10">
  <SOAP-ENV:Header>
    <eb:MessageHeader SOAP-ENV:mustUnderstand="1" eb:version="2.0">
      <eb:From>
        <eb:PartyId type="urn:x12.org:IO5:01">getgoing.com</eb:PartyId>
      </eb:From>
      <eb:To>
        <eb:PartyId type="urn:x12.org:IO5:01">webservices.sabre.com</eb:PartyId>
      </eb:To>
      <eb:CPAId>0O0G</eb:CPAId>
      <eb:ConversationId>4f7869aa-8940-11e5-9fb8-0eebf1123529</eb:ConversationId>
      <eb:Service eb:type="OTA">OTA_PingRQ</eb:Service>
      <eb:Action>OTA_PingRQ</eb:Action>
      <eb:MessageData>
        <eb:MessageId>d3fda980-8993-11e5-9fb8-0eebf1123529</eb:MessageId>
        <eb:Timestamp>2015-11-12T15:19:31Z</eb:Timestamp>
        <eb:TimeToLive>2015-11-12T15:19:31Z</eb:TimeToLive>
      </eb:MessageData>
    </eb:MessageHeader>
    <wsse:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">
      <wsse:BinarySecurityToken valueType="String" EncodingType="wsse:Base64Binary">Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/RESC!ICESMSLB\/RES.LB!-3470443832646253780!423578!0</wsse:BinarySecurityToken>
    </wsse:Security>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <OTA_PingRQ xmlns="http://www.opentravel.org/OTA/2003/05" TimeStamp="2014-02-28T15:15:00-06:00" Version="1.0.0">
      <EchoData>Are you there</EchoData>
    </OTA_PingRQ>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
