atibd/certification/pingRQ.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.opentravel.org/OTA/2003/05">
<soap:Header/>
    <soap:Body>
        <ns1:OTA_PingRQ Version="1.3">
            <ns1:EchoData>Welcome!</ns1:EchoData>
        </ns1:OTA_PingRQ>
    </soap:Body>
</soap:Envelope>