tests/test_cases/overlay_rate_plan.xml

<Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.opentravel.org/OTA/2003/05">
   <Header/>
   <Body>
        <OTA_HotelRatePlanNotifRQ xmlns="http://www.opentravel.org/OTA/2003/05"
                                TimeStamp="2018-10-27T18:13:32.387" EchoToken="e921106b-0f51-4e5d-88fd-1146d336302a"
                                Target="Production" Version="1.001" MessageContentCode="8">
            <RatePlans HotelCode="TEST_HOTEL">
                <RatePlan RatePlanCode="DSC" RatePlanNotifType="Overlay" MarketCode="DISC"
                        Start="2013-04-05" End="2013-09-02">
                    <Rates>
                        <Rate Start="2013-07-02" End="2013-07-02" CurrencyCode="USD"
                            InvTypeCode="KING">
                            <BaseByGuestAmts>
                                <BaseByGuestAmt NumberOfGuests="1" AgeQualifyingCode="10"
                                                AmountBeforeTax="200.00"/>
                                <BaseByGuestAmt NumberOfGuests="2" AgeQualifyingCode="10"
                                                AmountBeforeTax="250.00"/>
                            </BaseByGuestAmts>
                            <AdditionalGuestAmounts>
                                <AdditionalGuestAmount AgeQualifyingCode="10" Amount="40.00"/>
                                <AdditionalGuestAmount AgeQualifyingCode="8" Amount="15.00"/>
                            </AdditionalGuestAmounts>
                        </Rate>
                        <Rate Start="2013-07-02" End="2013-09-02" CurrencyCode="USD"
                            InvTypeCode="QUEEN">
                            <BaseByGuestAmts>
                                <BaseByGuestAmt NumberOfGuests="1" AgeQualifyingCode="10"
                                                AmountBeforeTax="180.00"/>
                                <BaseByGuestAmt NumberOfGuests="2" AgeQualifyingCode="10"
                                                AmountBeforeTax="205.00"/>
                            </BaseByGuestAmts>
                            <AdditionalGuestAmounts>
                                <AdditionalGuestAmount AgeQualifyingCode="10" Amount="30.00"/>
                                <AdditionalGuestAmount AgeQualifyingCode="8" Amount="12.00"/>
                            </AdditionalGuestAmounts>
                        </Rate>
                    </Rates>
                    <BookingRules>
                        <BookingRule>
                            <LengthsOfStay>
                                <LengthOfStay MinMaxMessageType="SetMinLOS" Time="1" TimeUnit="Day"/>
                                <LengthOfStay MinMaxMessageType="SetMaxLOS" Time="10"
                                            TimeUnit="Day"/>
                            </LengthsOfStay>
                        </BookingRule>
                    </BookingRules>
                    <Description Name="Short description">
                        <Text>Discount Rate 1</Text>
                    </Description>
                    <Description Name="Long description">
                        <Text>Discount Rate 1 - Room Only</Text>
                    </Description>
                </RatePlan>
            </RatePlans>
        </OTA_HotelRatePlanNotifRQ>
   </Body>
</Envelope>