src/test/resources/testfile.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <accor:serviceHeader xmlns:accor="http://www.accorhotels.com/ota/soap">
      <accor:service>OTA_PingRQ</accor:service>
      <accor:version>2006B</accor:version>
      <accor:requester>someone.com</accor:requester>
      <accor:serviceVersion>1.0</accor:serviceVersion>
    </accor:serviceHeader>
  </soap:Header>
  <soap:Body>
    <ota:OTA_PingRQ xmlns:ota="http://www.opentravel.org/OTA/2003/05" Version="1.000">
      <ota:EchoData>Are you there?</ota:EchoData>
    </ota:OTA_PingRQ>
  </soap:Body>
</soap:Envelope>
